from random import randint

w11 = "Коллеги,"
w12 = "парадигма цифровой экономики"
w13 = "открывает новые возможности для "
w14 = "дальнейшего углубления"
w15 = "знаний и компетенций"
w21 = "В то же время"
w22 = "контекст цифровой трансформации"
w23 = "выдвигает новые требования"
w24 = "бюджетного финансирования"
w25 = "непроверенных гипотез"
w31 = "Однако,"
w32 = "диджитализация бизнес-процессов"
w33 = "несет в себе риски"
w34 = "синергетического эффекта"
w35 = "волатильных активов."
w41 = "Тем не менее,"
w42 = "прагматичный подход к цифровым платформам"
w43 = "расширяет горизонты"
w44 = "коммерческой-конфиденциальных"
w45 = "опасных экспериментов"
w51 = "Следовательно"
w52 = "совокупность сквозных технологий"
w53 = "заставляет искать варианты"
w54 = "универсальной коммодификации"
w55 = "государственно-частных партнерств."
w61 = "Соответственно,"
w62 = "программа прорывных исследований"
w63 = "не оставляет шанса для"
w64 = "несанкционированной кастомизации"
w65 = "цифровых следов граждан."
w71 = "Вместе с тем,"
w72 = "ускорение блокчейн-транзакций"
w73 = "повышает вероятность"
w74 = "нормативного регулирования"
w75 = "нежелательных последствий. "
w81 = "С другой стороны,"
w82 = "экспоненциальный рост Big Data"
w83 = "обостряет проблему"
w84 = "практического применения"
w85 = "внезапных открытий."

end = ""

n1, n2, n3, n4, n5, n6, n7, n8 = (randint(1, 8), randint(1, 8), randint(1, 8),
                                  randint(1, 8), randint(1, 8), randint(1, 8),
                                  randint(1, 8), randint(1, 8),)

if n1 == 1:
    end += w11 + " "
elif n1 == 2:
    end += w21 + " "
elif n1 == 3:
    end += w31 + " "
elif n1 == 4:
    end += w41 + " "
elif n1 == 5:
    end += w51 + " "
elif n1 == 6:
    end += w61 + " "
elif n1 == 7:
    end += w71 + " "
elif n1 == 8:
    end += w81 + " "

if n2 == 1:
    end += w12 + " "
elif n2 == 2:
    end += w22 + " "
elif n2 == 3:
    end += w32 + " "
elif n2 == 4:
    end += w42 + " "
elif n2 == 5:
    end += w52 + " "
elif n2 == 6:
    end += w62 + " "
elif n2 == 7:
    end += w72 + " "
elif n2 == 8:
    end += w82 + " "

if n3 == 1:
    end += w13 + " "
elif n3 == 2:
    end += w23 + " "
elif n3 == 3:
    end += w33 + " "
elif n3 == 4:
    end += w43 + " "
elif n3 == 5:
    end += w53 + " "
elif n3 == 6:
    end += w63 + " "
elif n3 == 7:
    end += w73 + " "
elif n3 == 8:
    end += w83 + " "

if n4 == 1:
    end += w14 + " "
elif n4 == 2:
    end += w24 + " "
elif n4 == 3:
    end += w34 + " "
elif n4 == 4:
    end += w44 + " "
elif n4 == 5:
    end += w54 + " "
elif n4 == 6:
    end += w64 + " "
elif n4 == 7:
    end += w74 + " "
elif n4 == 8:
    end += w84 + " "

if n5 == 1:
    end += w15 + " "
elif n5 == 2:
    end += w25 + " "
elif n5 == 3:
    end += w35 + " "
elif n5 == 4:
    end += w45 + " "
elif n5 == 5:
    end += w55 + " "
elif n5 == 6:
    end += w65 + " "
elif n5 == 7:
    end += w75 + " "
elif n5 == 8:
    end += w85 + " "

print(end)







